## Instalação bibliotecas python para Ingestão & Análise Exploratória dos dados:

In [ ]:
!pip install pandas
!pip install numpy

!pip install openpyxl # resolver o erro Missing optional dependency 'openpyxl'

!pip freeze >> requirements.txt

Importando as bibliotecas python:

In [26]:
import pandas as pd
import numpy as np

## Ingestão & Análise Exploratória dos dados

Importação dos datasets (04) para análise exploratória:
Bancos.xlsx
Movimentos.xlsx
PlanoContas.xlsx
SaldoAnterior.xlsx

01. Dataset Bancos.xlsx

Obs.: Confirmar se o endereço do dataset está correto.

In [28]:
import os

caminho = "C:/Users/Usuário/Documents/_rma/_tecnologia/_data/evolve_data/projetos/fluxo_de_caixa_python_sql/dataset/Bancos.xlsx"

print(os.path.exists(caminho))  # Retorna True se o arquivo for encontrado

True

Criar dataframe e visualizar as primeiras linhas:

In [27]:
df_bancos = pd.read_excel("C:/Users/Usuário/Documents/_rma/_tecnologia/_data/evolve_data/projetos/fluxo_de_caixa_python_sql/dataset/Bancos.xlsx", sheet_name="Bancos")
df_bancos.head()

   Banco_ID          Banco
0         1  Itau Unibanco
1         2       Bradesco
2         3          Inter

Verificar os tipos de dados e colunas do dataframe:

In [29]:
df_bancos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Banco_ID  3 non-null      int64
 1   Banco     3 non-null      object
dtypes: int64(1), object(1)
memory usage: 180.0+ bytes

Verificar valores nulos do dataframe:

In [30]:
df_bancos.isnull().sum()

Banco_ID    0
Banco       0
dtype: int64

Verificar valores duplicados:

In [31]:
duplicate_value_bancos = df_bancos.duplicated()
print(f"Total de valores duplicados: {duplicate_value_bancos.sum()}")

Total de valores duplicados: 0

Verificar a estatística das colunas textuais do dataframe:

In [34]:
df_bancos.describe(include=["object"])

                Banco
count               3
unique              3
top     Itau Unibanco
freq                1

02. Dataset PlanoContas.xlsx

Criar dataframe e visualizar as primeiras linhas:

In [ ]:

df_contas.head()df_contas = pd.read_excel("C:/Users/Usuário/Documents/_rma/_tecnologia/_data/evolve_data/projetos/fluxo_de_caixa_python_sql/dataset/PlanoContas.xlsx", sheet_name="PlanoContas")

   Subgrupo_ID                  Subgrupo  Conta_ID                       Conta
0         1100       Receitas com vendas      1101          Vendas de produtos
1         1200      Receitas financeiras      1201       Receita de aplicações
2         1200      Receitas financeiras      1202  Transferências de entradas
3         2100  Pagamento a fornecedores      2101               Matéria-prima
4         2100  Pagamento a fornecedores      2102            Energia elétrica

Verificar os tipos de dados e colunas do dataframe:

In [36]:
df_contas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 27 entries, 0 to 26
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Subgrupo_ID  27 non-null     int64
 1   Subgrupo     27 non-null     object
 2   Conta_ID     27 non-null     int64
 3   Conta        27 non-null     object
dtypes: int64(2), object(2)
memory usage: 996.0+ bytes

Verificar valores nulos do dataframe:

In [37]:
df_contas.isnull().sum()

Subgrupo_ID    0
Subgrupo       0
Conta_ID       0
Conta          0
dtype: int64

Verificar valores duplicados:

In [38]:
duplicate_value_contas = df_contas.duplicated()
print(f"Total de valores duplicados: {duplicate_value_contas.sum()}")

Total de valores duplicados: 0

Verificar a estatística das colunas textuais do dataframe:

In [39]:
df_contas.describe(include=["object"])

                        Subgrupo               Conta
count                         27                  27
unique                         7                  27
top     Pagamento a fornecedores  Vendas de produtos
freq                          12                   1

03. Dataset Movimentos.xlsx

Criar dataframe e visualizar as primeiras linhas:

In [41]:
df_movimentos = pd.read_excel("C:/Users/Usuário/Documents/_rma/_tecnologia/_data/evolve_data/projetos/fluxo_de_caixa_python_sql/dataset/Movimentos.xlsx", sheet_name="Movimentos")
df_movimentos.head()

       Tipo               Conta       Data          Banco        Valor
0  Entradas  Vendas de produtos 2023-01-02  Itau Unibanco   4201365.79
1    Saídas              Fretes 2023-01-02  Itau Unibanco     -2211.34
2    Saídas            Salários 2023-01-02  Itau Unibanco -10380086.42
3    Saídas            Encargos 2023-01-02  Itau Unibanco  -4040434.14
4    Saídas          Benefícios 2023-01-02  Itau Unibanco  -4003418.21

Verificar os tipos de dados e colunas do dataframe:

In [42]:
df_movimentos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14931 entries, 0 to 14930
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Tipo    14931 non-null  object
 1   Conta   14931 non-null  object
 2   Data    14931 non-null  datetime64[ns]
 3   Banco   14931 non-null  object
 4   Valor   14931 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(3)
memory usage: 583.4+ KB

Verificar valores nulos do dataframe:

In [43]:
df_movimentos.isnull().sum()

Tipo     0
Conta    0
Data     0
Banco    0
Valor    0
dtype: int64

Verificar valores duplicados:

In [44]:
duplicate_value_movimentos = df_movimentos.duplicated()
print(f"Total de valores duplicados: {duplicate_value_movimentos.sum()}")

Total de valores duplicados: 0

Verificar a estatística das colunas numéricas do dataframe:

In [45]:
df_movimentos.describe()

                                Data         Valor
count                          14931  1.493100e+04
mean   2023-09-04 20:58:35.370705408 -3.935599e+02
min              2023-01-02 00:00:00 -1.100000e+07
25%              2023-05-04 00:00:00 -8.790150e+02
50%              2023-09-04 00:00:00 -2.897000e+01
75%              2024-01-09 00:00:00  0.000000e+00
max              2024-05-10 00:00:00  1.100000e+07
std                              NaN  9.249585e+05

Verificar a estatística das colunas textuais do dataframe:

In [46]:
df_movimentos.describe(include=["object"])

          Tipo               Conta          Banco
count    14931               14931          14931
unique       2                  27              3
top     Saídas  Vendas de produtos  Itau Unibanco
freq     11871                1020           4977

04. Dataset SaldoAnterior.xlsx

Criar dataframe e visualizar as primeiras linhas:

In [47]:
df_saldo = pd.read_excel("C:/Users/Usuário/Documents/_rma/_tecnologia/_data/evolve_data/projetos/fluxo_de_caixa_python_sql/dataset/SaldoAnterior.xlsx", sheet_name="SaldoAnterior")
df_saldo.head()

   Banco_ID    Valor
0         1  5000000
1         2 -1000000
2         3   500000

Verificar os tipos de dados e colunas do dataframe:

In [48]:
df_saldo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Banco_ID  3 non-null      int64
 1   Valor     3 non-null      int64
dtypes: int64(2)
memory usage: 180.0 bytes

Verificar valores nulos do dataframe:

In [49]:
df_saldo.isnull().sum()

Banco_ID    0
Valor       0
dtype: int64

Verificar valores duplicados:

In [50]:
duplicate_value_saldo = df_saldo.duplicated()
print(f"Total de valores duplicados: {duplicate_value_saldo.sum()}")

Total de valores duplicados: 0

Verificar a estatística das colunas numéricas do dataframe:

In [51]:
df_saldo.describe()

       Banco_ID         Valor
count       3.0  3.000000e+00
mean        2.0  1.500000e+06
std         1.0  3.122499e+06
min         1.0 -1.000000e+06
25%         1.5 -2.500000e+05
50%         2.0  5.000000e+05
75%         2.5  2.750000e+06
max         3.0  5.000000e+06

## Carga dos dataframes (Tabelas) no Banco de Dados

Dataframes: <br>
- df_bancos
- df_contas
- df_movimentos
- df_saldo

### Conexão com o banco de dados

In [ ]:
!pip install sqlalchemy psycopg2 pandas
!pip freeze >> requirements.txt

### Install e Import bibliotecas `dotenv e os` para armazenar dados sensíveis, ex.: senhas

In [ ]:
!pip install python-dotenv
!pip freeze >> requirements.txt

In [61]:
import os
from dotenv import load_dotenv

load_dotenv()

True

In [62]:
db_password = os.getenv("password")

In [63]:
from sqlalchemy import create_engine

# Conexão
usuario = "postgres"
senha = db_password
host = "localhost"
porta = "5432"
banco = "db_cash_flow"

# Criando engine de conexão
engine = create_engine(f"postgresql+psycopg2://{usuario}:{senha}@{host}:{porta}/{banco}")

## Enviando os `dataframes` para o banco de dados "db_cash_flow" no PostgreSQL

In [65]:
nome_tabela_1 = "bancos"
nome_tabela_2 = "contas"
nome_tabela_3 = "movimentos"
nome_tabela_4 = "saldo"

df_bancos.to_sql(nome_tabela_1, engine, if_exists='replace', index=False)
df_contas.to_sql(nome_tabela_2, engine, if_exists='replace', index=False)
df_movimentos.to_sql(nome_tabela_3, engine, if_exists='replace', index=False)
df_saldo.to_sql(nome_tabela_4, engine, if_exists='replace', index=False)

3